{
  "autoMode": "Auto Mode",
  "autoModeDesc": "When enabled, pasting code doesn't require clicking the confirm button; it will automatically callback.<br>Note: In auto mode, you can only paste code; you cannot edit after pasting.",

  "acb_html": "<span>Auto Code Block</span>",
  "acb_window_title": "Input code to automatically detect language",
  "acb_window_title_automode": "Paste code to automatically callback and detect language",
  "acb_window_input_placehoder": "Paste/edit or input code here. If you want to automatically callback after pasting, please enable auto mode in plugin settings.",
  "acb_window_input_placehoder_automode": "Paste code here. If you want to input/edit code, please disable auto mode in plugin settings.",
  "acb_show_message_prefix": "Detected language: ",
  "acb_show_message_language_unknown": "No valid language information detected",

  "languageBlacklist": "Language Blacklist",
  "languageBlacklistDesc": "If the detected language is in the blacklist, it will be pasted as is without automatic code block highlighting. Use Chinese or English full-width commas to separate, do not write spaces, C++ should be filled as cpp, C♯ (C Sharp) should be filled as c#, for example: cpp,c,rust,c#,typescript,java,javascript,php.",
  "languageSkiplist": "Language Skip (Fallback) List",
  "languageSkiplistDesc": "If the detected language is in the fallback list, it will fallback to the next most likely language. If the next most likely language is also in the list, it will continue to fallback. If it falls back to the end, it will be pasted as is. Use Chinese or English full-width commas to separate, do not write spaces. The order of entry does not affect the fallback order. C++ should be filled as cpp, C♯ (C Sharp) should be filled as c#, for example: cpp,c,rust,c#,typescript,java,javascript,php.",

  "pasteAutoMode":"Paste Auto Detect",
  "pasteAutoModeDesc":"When enable, it automatically detect the language and paste with language specific highlight code block. If not detected, it will paste as plain text.",
  "full_auto_paste_message": "Detected this language ^&*^&*@@@^&*^&*^&* , automatically pasted as code block with highlight",

  "cancel": "Cancel",
  "save": "Save",
  "hintTitle": "About",
  "hintDesc": "<ul><li>● Made by <a href='https://github.com/zxkmm'>zxkmm</a>, open-sourced under MIT license.</li><li>● If you like this plugin, please give my GitHub repository a free star ⭐.</li><li>● Link: <a href='https://github.com/zxkmm/siyuan_auto_codeblock'>https://github.com/zxkmm/siyuan_auto_codeblock</a></li><li>"
}
